tasks/variants/emb_debug_loss/mutation.patch
--- a/torchtitan/experiments/embedding/losses.py
+++ b/torchtitan/experiments/embedding/losses.py
@@ -14,9 +14,6 @@
     """InfoNCE contrastive loss with in-batch negatives and false negative masking."""
     B, D = query_embeds.shape
 
-    query_embeds = F.normalize(query_embeds, dim=-1)
-    positive_embeds = F.normalize(positive_embeds, dim=-1)
-    negative_embeds = F.normalize(negative_embeds, dim=-1)
 
     pos_scores = (query_embeds * positive_embeds).sum(dim=-1) / temperature
 
