tasks/variants/flux_debug_attn/10_mutation.patch
--- a/torchtitan/models/flux/model/model.py
+++ b/torchtitan/models/flux/model/model.py
@@ -172,7 +172,7 @@
 
         # running on sequences img
         img = self.img_in(img)
-        vec = self.time_in(timestep_embedding(timesteps, 256))
+        vec = self.time_in(timestep_embedding(torch.zeros_like(timesteps), 256))
         vec = vec + self.vector_in(y)
         txt = self.txt_in(txt)
